################################################################################
### initialize #################################################################
################################################################################
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'mongodb/brew'
brew 'mas'
################################################################################
### editor #####################################################################
################################################################################
cask 'visual-studio'
cask 'visual-studio-code'
################################################################################
### terminal ###################################################################
################################################################################
cask 'iterm2'
################################################################################
### lang #######################################################################
################################################################################
cask 'dotnet-sdk'
cask 'java'
brew 'go'
brew 'node'
brew 'python3'
brew 'R'
brew 'rust'
################################################################################
### browser ####################################################################
################################################################################
cask 'firefox'
cask 'microsoft-edge-dev'
################################################################################
### github #####################################################################
################################################################################
brew 'git'
brew 'git-flow'
brew 'git-lfs'
cask 'github'
brew 'hub'
################################################################################
### social #####################################################################
################################################################################
cask 'slack'
################################################################################
### virtual ####################################################################
################################################################################
brew 'packer'
cask 'virtualbox'
cask 'vagrant'
brew 'xhyve'
################################################################################
### container ##################################################################
################################################################################
brew 'consul'
brew 'docker-machine-driver-hyperkit'
brew 'docker-machine-driver-xhyve'
brew 'docker-machine'
cask 'docker'
brew 'etcd'
brew 'faas-cli'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'minikube'
################################################################################
### cloud storage ##############################################################
################################################################################
cask 'box-sync'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'sync'
################################################################################
### cloud apis #################################################################
################################################################################
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
################################################################################
### analytics ##################################################################
################################################################################
brew 'octave'
cask 'rstudio'
################################################################################
### ide ########################################################################
################################################################################
cask 'unity'
################################################################################
### config #####################################################################
################################################################################
brew 'ansible'
cask 'powershell'
brew 'saltstack'
brew 'terraform'
################################################################################
### stores #####################################################################
################################################################################
brew 'cassandra'
brew 'mariadb'
brew 'mongodb-community'
brew 'postgresql'
brew 'redis'
################################################################################
### queues #####################################################################
################################################################################
brew 'rabbitmq'
brew 'zeromq'
################################################################################
### microservices ##############################################################
################################################################################
brew 'jetty'
brew 'nginx'
################################################################################
### iot ########################################################################
################################################################################
cask 'arduino'
cask 'balenaetcher'
################################################################################
### office #####################################################################
################################################################################
cask 'microsoft-office'
################################################################################
### utilities ##################################################################
################################################################################
brew 'asciinema'
brew 'graphviz'
brew 'gettext'
brew 'gomplate'
brew 'imagemagick'
brew 'jq'
brew 'openssl'
brew 'tmux'
brew 'ttyrec'
brew 'unrar'
brew 'wget'
brew 'xz'

cask 'adobe-acrobat-reader'
cask 'authy'
cask 'blender'
cask 'brave-browser'
cask 'cleanmymac'
cask 'drawio'
cask 'falcon-sql-client'
cask 'freecad'
cask 'inkscape'
cask 'kindle'
brew 'librsvg'
cask 'monodraw'
cask 'musescore'
cask 'openscad'
cask 'spectacle'
cask 'wireshark'
brew 'youtube-dl'
cask 'zoomus'