################################################################################
### initialize #################################################################
################################################################################
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
brew 'mas'
tap 'snyk/tap'
################################################################################
### editor #####################################################################
################################################################################
cask 'visual-studio-code'
################################################################################
### terminal ###################################################################
################################################################################
cask 'iterm2'
################################################################################
### lang #######################################################################
################################################################################
cask 'dotnet-sdk'
brew 'go'
brew 'jenv'
cask 'corretto'
brew 'openjdk'
cask 'temurin'
cask 'zulu'
brew 'scala'
brew 'nvm'
brew 'node'
brew 'R'
brew 'rustup'
################################################################################
### browser ####################################################################
################################################################################
cask 'firefox'
cask 'google-chrome'
cask 'microsoft-edge-dev'
cask 'tor-browser'
################################################################################
### github #####################################################################
################################################################################
brew 'git'
brew 'git-flow'
brew 'git-lfs'
cask 'github'
brew 'hub'
################################################################################
### social #####################################################################
################################################################################
cask 'slack'
################################################################################
### cloud native ###############################################################
################################################################################
brew 'dive'
brew 'helm'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'lima'
brew 'colima'
brew 'minikube'
brew 'podman'
brew 'skaffold'
brew 'skopeo'
brew 'snyk-iac-rules'
brew 'snyk'
brew 'trivy'
cask 'docker'
cask 'microsoft-azure-storage-explorer'
cask 'multipass'
cask 'utm'
################################################################################
### cloud storage ##############################################################
################################################################################
cask 'box-sync'
cask 'google-drive'
cask 'sync'
################################################################################
### cloud apis #################################################################
################################################################################
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
################################################################################
### analytics ##################################################################
################################################################################
cask 'miniforge'
cask 'rstudio'
################################################################################
### config #####################################################################
################################################################################
brew 'ansible'
################################################################################
### stores #####################################################################
################################################################################
brew 'cassandra'
brew 'mariadb'
brew 'postgresql@14'
brew 'redis'
################################################################################
### queues #####################################################################
################################################################################
brew 'rabbitmq'
brew 'zeromq'
################################################################################
### office #####################################################################
################################################################################
cask 'microsoft-office'
cask 'microsoft-teams'
################################################################################
### utilities ##################################################################
################################################################################
brew 'gettext'
brew 'coreutils'
brew 'gomplate'
brew 'graphviz'
brew 'hey'
brew 'imagemagick'
brew 'jq'
brew 'openssl'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'wget'
brew 'xz'

cask 'ableton-live-suite'
cask 'adobe-acrobat-reader'
cask 'authy'
cask 'blender'
cask 'chromedriver'
cask 'deezer'
cask 'drawio'
cask 'freecad'
cask 'gimp'
cask 'inkscape'
cask 'insomnia'
cask 'kindle'
cask 'musescore'
cask 'openscad'
cask 'powershell'
cask 'spectacle'
cask 'spotify'
cask 'stats'
cask 'wireshark'
################################################################################
### mac app store ##############################################################
################################################################################
