################################################################################
### lang #######################################################################
################################################################################
cask 'java8'
cask 'java'

brew 'go'
brew 'node'
brew 'python3'
brew 'R'
brew 'rust'
################################################################################
### quicklook ##################################################################
################################################################################
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
################################################################################
### browser ####################################################################
################################################################################
cask 'firefox'
cask 'google-chrome'
################################################################################
### github #####################################################################
################################################################################
brew 'git'
brew 'git-flow'
brew 'git-lfs'
cask 'github'
################################################################################
### social #####################################################################
################################################################################
cask 'slack'
################################################################################
### virtual ####################################################################
################################################################################
brew 'packer'
cask 'virtualbox'
cask 'vagrant'
brew 'xhyve'
################################################################################
### container ##################################################################
################################################################################
brew 'consul'
brew 'docker-machine-driver-hyperkit'
brew 'docker-machine-driver-xhyve'
brew 'docker-machine'
brew 'docker'
brew 'etcd'
brew 'faas-cli'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
cask 'minikube'
################################################################################
### cloud storage ##############################################################
################################################################################
cask 'box-sync'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'sync'
################################################################################
### cloud apis #################################################################
################################################################################
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
################################################################################
### analytics ##################################################################
################################################################################
cask 'anaconda'
brew 'octave'
cask 'rstudio'
################################################################################
### ide ########################################################################
################################################################################
cask 'unity'
################################################################################
### config #####################################################################
################################################################################
brew 'ansible'
cask 'powershell'
brew 'saltstack'
brew 'terraform'
################################################################################
### stores #####################################################################
################################################################################
brew 'cassandra'
brew 'mariadb'
brew 'mongodb'
brew 'neo4j'
brew 'postgresql'
brew 'redis'
################################################################################
### queues #####################################################################
################################################################################
brew 'rabbitmq'
brew 'zeromq'
################################################################################
### microservices ##############################################################
################################################################################
brew 'jetty'
brew 'nginx'
################################################################################
### iot ########################################################################
################################################################################
cask 'arduino'
cask 'balenaetcher'
################################################################################
### office #####################################################################
################################################################################
cask 'microsoft-office'
################################################################################
### utilities ##################################################################
################################################################################
brew 'imagemagick'
brew 'jq'
brew 'graphviz'
brew 'openssl'
brew 'ttyrec'
brew 'unrar'
brew 'wget'
brew 'xz'

cask 'adobe-acrobat-reader'
cask 'blender'
cask 'brave-browser'
cask 'drawio'
cask 'keybase'
cask 'kindle'
cask 'monodraw'
cask 'musescore'
cask 'sketch'
cask 'spectacle'
cask 'wireshark'
